#coding=utf_8

#用户条件限制[最少做题数，最多做题数，最小通过率，最大通过率]
userLC=[15,1000000,0.06,1]

#问题条件限制[最少做题数，最多做题数，最小通过率，最大通过率]
problemLC=[10,1000000,0.02,1]

#hdu数据集参数
DataNam='hdu'
TmDir='data/hdu/'
timeLC_for_KPT=['2018-11-22 20:45:48','2018-11-29 11:22:08']
timeLC=['2018-11-22 20:45:48','2018-11-29 11:22:08']
timdivid= 12

# #NEULC数据集参数
# DataNam='NEULC'
# TmDir='data/NEULC/'
# timeLC_for_KPT=['2018-04-12 14:26.34','2019-07-01 08:19:10']
# timeLC=['2019-03-11 14:26:32','2019-07-01 08:19:10']
# timdivid= 4






